<a href="https://colab.research.google.com/github/samirlenka/pandas_exercises/blob/master/04_Apply/Students_Alcohol_Consumption/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [24]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv).

### Step 3. Assign it to a variable called df.

In [25]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv')
df.head(5)

  school sex  age address famsize Pstatus  ...  Walc  health absences  G1  G2  G3
0     GP   F   18       U     GT3       A  ...     1       3        6   5   6   6
1     GP   F   17       U     GT3       T  ...     1       3        4   5   5   6
2     GP   F   15       U     LE3       T  ...     3       3       10   7   8  10
3     GP   F   15       U     GT3       T  ...     1       5        2  15  14  15
4     GP   F   16       U     GT3       T  ...     2       5        4   6  10  10

[5 rows x 33 columns]

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [26]:
#stud = df.loc[:, 'school':'guardian'].head(5)
stud = df.loc[:, 'school':'guardian']
stud.head(5)

  school sex  age address famsize  ... Fedu     Mjob      Fjob  reason guardian
0     GP   F   18       U     GT3  ...    4  at_home   teacher  course   mother
1     GP   F   17       U     GT3  ...    1  at_home     other  course   father
2     GP   F   15       U     LE3  ...    1  at_home     other   other   mother
3     GP   F   15       U     GT3  ...    2   health  services    home   mother
4     GP   F   16       U     GT3  ...    3    other     other    home   father

[5 rows x 12 columns]

### Step 5. Create a lambda function that will capitalize strings.

In [27]:
capitalizer = lambda x : x.capitalize()

### Step 6. Capitalize both Mjob and Fjob

In [28]:
stud['Mjob'].apply(capitalizer)
stud.Fjob.apply(capitalizer)

0       Teacher
1         Other
2         Other
3      Services
4         Other
         ...
390    Services
391    Services
392       Other
393       Other
394     At_home
Name: Fjob, Length: 395, dtype: object

### Step 7. Print the last elements of the data set.

In [29]:
stud.tail()

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  services  services  course    other
391     MS   M   17       U     LE3  ...    1  services  services  course   mother
392     MS   M   21       R     GT3  ...    1     other     other  course    other
393     MS   M   18       R     LE3  ...    2  services     other  course   mother
394     MS   M   19       U     LE3  ...    1     other   at_home  course   father

[5 rows x 12 columns]

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob.

In [30]:
stud['Mjob'] = stud['Mjob'].apply(capitalizer)
stud['Fjob'] = stud['Fjob'].apply(capitalizer)
stud.head(5)
stud.tail(5)

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  Services  Services  course    other
391     MS   M   17       U     LE3  ...    1  Services  Services  course   mother
392     MS   M   21       R     GT3  ...    1     Other     Other  course    other
393     MS   M   18       R     LE3  ...    2  Services     Other  course   mother
394     MS   M   19       U     LE3  ...    1     Other   At_home  course   father

[5 rows x 12 columns]

### Step 9. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [31]:
'''
def mejority (x) :
  if x>17 :
    return "Eligible"
  else :
    return "Not Eligible"
'''

def mejority (x) :
  if x>17 :
    return True
  else :
    return False

In [32]:
stud['legal_drink'] = stud['age'].apply(mejority)
stud.head(5)

  school sex  age address  ...      Fjob  reason  guardian  legal_drink
0     GP   F   18       U  ...   Teacher  course    mother         True
1     GP   F   17       U  ...     Other  course    father        False
2     GP   F   15       U  ...     Other   other    mother        False
3     GP   F   15       U  ...  Services    home    mother        False
4     GP   F   16       U  ...     Other    home    father        False

[5 rows x 13 columns]

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

In [33]:
def multitimes10(x) :
  if type(x) is int :
    return x*10
  return x

In [35]:
stud.applymap(multitimes10).head(5)

  school sex  age address  ...      Fjob  reason  guardian  legal_drink
0     GP   F  180       U  ...   Teacher  course    mother         True
1     GP   F  170       U  ...     Other  course    father        False
2     GP   F  150       U  ...     Other   other    mother        False
3     GP   F  150       U  ...  Services    home    mother        False
4     GP   F  160       U  ...     Other    home    father        False

[5 rows x 13 columns]